RhinoInside.Revit API Documentation
ColorConverter.ToColor Method (Color)
 Converts the specified Autodesk.Revit.DB.Color to an equivalent Eto.Drawing.Color.
 Namespace: RhinoInside.Revit.Convert.Eto.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Eto.Drawing.Color ToColor(
	this Autodesk.Revit.DB.Color color
)
@staticmethod
def ToColor(
	color: Autodesk.Revit.DB.Color
) -> Eto.Drawing.Color
Parameters
color
Type: Autodesk.Revit.DB.Color
Revit color to convert.
Return Value
Type: Eto.Drawing.Color
Eto color that is equivalent to the provided Revit color.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToColor(Color) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Eto.Drawing;
Color etoColor = revitColor.ToColor();
import clr
clr.AddReference("Eto")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from Eto.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Eto.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.Eto.Drawing)
eto_color = revit_color.ToColor()    # type: Color
 Using ToColor(Color) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Eto.Drawing;
Color etoColor = ColorConverter.ToColor(revitColor)
import clr
clr.AddReference("Eto")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from Eto.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Eto.Drawing.ColorConverter as CC
eto_color = CC.ToColor(revit_color)    # type: Color
See Also
Reference
ColorConverter Class
ToColor Overload
RhinoInside.Revit.Convert.Eto.Drawing Namespace